src/main/resources/request.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"
				  xmlns:gs="http://microservice.blaszak.pl/login">
   <soapenv:Header/>
   <soapenv:Body>
        <gs:loginRequest>
            <gs:loginName>klaszke</gs:loginName>
            <gs:password>kbaszkePass</gs:password>:
        </gs:loginRequest>
   </soapenv:Body>
</soapenv:Envelope>
